In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]], columns=["A","B","C","D"])

In [3]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [4]:
df2 = pd.DataFrame([[5,6,7,8],[1,2,3,4],[13,14,15,16],[17,18,19,20],[9,10,11,12]], columns=["D","F","G","H"])

In [5]:
df2

    D   F   G   H
0   5   6   7   8
1   1   2   3   4
2  13  14  15  16
3  17  18  19  20
4   9  10  11  12

In [6]:
df3 = pd.merge(df1, df2)

In [7]:
df3

Empty DataFrame
Columns: [A, B, C, D, F, G, H]
Index: []

In [9]:
# manishaisageniusgirl